# Dropping entries from an axis
Dropping entries from an axis can be done using `drop()` method.

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [2]:
frame = DataFrame(np.arange(16).reshape(4, 4), 
                  index=['India', 'China', 'USA', 'Russia'], 
                  columns=['one', 'two', 'three', 'four'])
frame

        one  two  three  four
India     0    1      2     3
China     4    5      6     7
USA       8    9     10    11
Russia   12   13     14    15

In [6]:
frame.drop('two', axis=1)

        one  three  four
India     0      2     3
China     4      6     7
USA       8     10    11
Russia   12     14    15